Autodesk.Revit.DB.FilledRegion.IsRegionCreationEnabledInView(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
document:
The document.
viewId:
The view Id.
Returns:
True if region creation is enabled.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.FilledRegion.IsValidFilledRegionTypeId(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Indicates whether the given Id is a valid filled region type Id.
document:
The document.
typeId:
The filled region type Id.
Returns:
True if it is a valid filled region type Id, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.FilledRegion.IsValidLineStyleIdForFilledRegion(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Indicates whether the given Id is a valid line style Id.
document:
The document.
lineStyleId:
The line style Id.
Returns:
True if it is a valid line style Id, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.FilledRegion.GetValidLineStyleIdsForFilledRegion(Autodesk.Revit.DB.Document)
Gets the line style Ids which are permitted to be assigned to a filled region.
document:
The document.
Returns:
The valid line style Ids.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.FilledRegion.SetLineStyleId(Autodesk.Revit.DB.ElementId)
Sets the line style Id for all boundaries.
lineStyleId:
The line style Id.
Throws Autodesk.Revit.Exceptions.ArgumentException:
lineStyleId is not a valid line style Id for a filled region.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.FilledRegion.CreateMaskingRegion(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.SketchPlane,System.Collections.Generic.IList{Autodesk.Revit.DB.CurveLoop})
Creates a masking region on a sketch plane in a 3d model family.
Remarks:
If the sketch plane is currently in use, then a copy of the sketch plane will be created and used.
The sketch plane normal must be parallel to the model's X, Y or Z axis.
The sketch plane can be a planar face reference to model geometry.
The line style of the boundaries will be set to thin lines by default.
document:
The family document in which to create the masking region.
sketchPlane:
The sketch plane for use with the masking region.
boundaries:
The masking region boundaries, which will be projected onto the sketch plane.
Returns:
The new masking region.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The document is not a 3d model family.
-or-
Filled regions can't be created in this document or view.
-or-
The sketch plane is not suitable for model elements.
-or-
The sketch plane normal is not parallel to the model's X, Y or Z axis.
-or-
The input curve loops cannot compose a valid boundary, that means:
the "curveLoops" collection is empty;
or some curve loops intersect with each other;
or each curve loop is not closed individually;
or each curve loop is not planar;
or each curve loop is not in a plane parallel to the sketch plane;
or input curves contain at least one helical curve.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2024

Autodesk.Revit.DB.FilledRegion.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.SketchPlane,System.Collections.Generic.IList{Autodesk.Revit.DB.CurveLoop})
Creates a filled region on a sketch plane in a 3d model family.
Remarks:
If the sketch plane is currently in use, then a copy of the sketch plane will be created and used.
The sketch plane normal must be parallel to the model's X, Y or Z axis.
The sketch plane can be a planar face reference to model geometry.
The line style of the boundaries will be set to thin lines by default.
document:
The family document in which to create the filled region.
typeId:
The filled region type Id.
sketchPlane:
The sketch plane for use with the filled region.
boundaries:
The filled region boundaries, which will be projected onto the sketch plane.
Returns:
The new filled region.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The document is not a 3d model family.
-or-
The Id typeId is invalid.
-or-
Filled regions can't be created in this document or view.
-or-
The sketch plane is not suitable for model elements.
-or-
The sketch plane normal is not parallel to the model's X, Y or Z axis.
-or-
The input curve loops cannot compose a valid boundary, that means:
the "curveLoops" collection is empty;
or some curve loops intersect with each other;
or each curve loop is not closed individually;
or each curve loop is not planar;
or each curve loop is not in a plane parallel to the sketch plane;
or input curves contain at least one helical curve.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2023

Autodesk.Revit.DB.FilledRegion.CreateMaskingRegion(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,System.Collections.Generic.IList{Autodesk.Revit.DB.CurveLoop})
Creates a view-specific masking region from the given boundaries.
Remarks:
View-specific masking regions can be created in models and 2d families.
The line style of the boundaries will be set to thin lines by default.
document:
The document in which to create the masking region.
viewId:
The view Id.
boundaries:
The boundaries.
Returns:
The newly created masking region.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The document is a 3d model family.
-or-
Details can't be drawn in the view.
-or-
Masking regions and Filled regions can't be created in this document or view.
-or-
The input curve loops cannot compose a valid boundary, that means:
the "curveLoops" collection is empty;
or some curve loops intersect with each other;
or each curve loop is not closed individually;
or each curve loop is not planar;
or each curve loop is not in a plane parallel to the view's detail sketch plane;
or input curves contain at least one helical curve.
-or-
Thrown if the viewId is invalid, or the view does not support
the detail items creation, or if the boundaries are empty, open, or self-intersecting.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2024

Autodesk.Revit.DB.FilledRegion.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId,System.Collections.Generic.IList{Autodesk.Revit.DB.CurveLoop})
Creates a view-specific filled region from the given boundaries.
Remarks:
View-specific filled regions can be created in models and 2d families.
The line style of the boundaries will be set to thin lines by default.
document:
The document in which to create the filled region.
typeId:
The filled region type Id.
viewId:
The view Id.
boundaries:
The boundaries.
Returns:
The newly created filled region.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The document is a 3d model family.
-or-
The Id typeId is invalid.
-or-
Details can't be drawn in the view.
-or-
Masking regions and Filled regions can't be created in this document or view.
-or-
The input curve loops cannot compose a valid boundary, that means:
the "curveLoops" collection is empty;
or some curve loops intersect with each other;
or each curve loop is not closed individually;
or each curve loop is not planar;
or each curve loop is not in a plane parallel to the view's detail sketch plane;
or input curves contain at least one helical curve.
-or-
Thrown if the viewId or typeId is invalid, or the view does not support
the detail items creation, or if the boundaries are empty, open, or self-intersecting.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013